LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_OVP2S_DEFAULT_VALUE	(0)
#define AW_PID_1852_OVP2S_DEFAULT		\
	(AW_PID_1852_OVP2S_DEFAULT_VALUE << AW_PID_1852_OVP2S_START_BIT)

/* UVLS bit 14 (SYSST 0x01) */
#define AW_PID_1852_UVLS_START_BIT		(14)
#define AW_PID_1852_UVLS_BITS_LEN		(1)
#define AW_PID_1852_UVLS_MASK			\
	(~(((1<<AW_PID_1852_UVLS_BITS_LEN)-1) << AW_PID_1852_UVLS_START_BIT))

#define AW_PID_1852_UVLS_VDD_ABOVE_2P8V	(0)
#define AW_PID_1852_UVLS_VDD_ABOVE_2P8V_VALUE	\
	(AW_PID_1852_UVLS_VDD_ABOVE_2P8V << AW_PID_1852_UVLS_START_BIT)

#define AW_PID_1852_UVLS_VDD_BELOW_2P8V	(1)
#define AW_PID_1852_UVLS_VDD_BELOW_2P8V_VALUE	\
	(AW_PID_1852_UVLS_VDD_BELOW_2P8V << AW_PID_1852_UVLS_START_BIT)

#define AW_PID_1852_UVLS_DEFAULT_VALUE	(0)
#define AW_PID_1852_UVLS_DEFAULT		\
	(AW_PID_1852_UVLS_DEFAULT_VALUE << AW_PID_1852_UVLS_START_BIT)

/* ADPS bit 13 (SYSST 0x01) */
#define AW_PID_1852_ADPS_START_BIT		(13)
#define AW_PID_1852_ADPS_BITS_LEN		(1)
#define AW_PID_1852_ADPS_MASK			\
	(~(((1<<AW_PID_1852_ADPS_BITS_LEN)-1) << AW_PID_1852_ADPS_START_BIT))

#define AW_PID_1852_ADPS_TRANSPARENT	(0)
#define AW_PID_1852_ADPS_TRANSPARENT_VALUE	\
	(AW_PID_1852_ADPS_TRANSPARENT << AW_PID_1852_ADPS_START_BIT)

#define AW_PID_1852_ADPS_BOOST			(1)
#define AW_PID_1852_ADPS_BOOST_VALUE	\
	(AW_PID_1852_ADPS_BOOST << AW_PID_1852_ADPS_START_BIT)

#define AW_PID_1852_ADPS_DEFAULT_VALUE	(0)
#define AW_PID_1852_ADPS_DEFAULT		\
	(AW_PID_1852_ADPS_DEFAULT_VALUE << AW_PID_1852_ADPS_START_BIT)

/* BSTOCS bit 11 (SYSST 0x01) */
#define AW_PID_1852_BSTOCS_START_BIT	(11)
#define AW_PID_1852_BSTOCS_BITS_LEN		(1)
#define AW_PID_1852_BSTOCS_MASK			\
	(~(((1<<AW_PID_1852_BSTOCS_BITS_LEN)-1) << AW_PID_1852_BSTOCS_START_BIT))

#define AW_PID_1852_BSTOCS_DEFAULT_VALUE	(0)
#define AW_PID_1852_BSTOCS_DEFAULT		\
	(AW_PID_1852_BSTOCS_DEFAULT_VALUE << AW_PID_1852_BSTOCS_START_BIT)

#define AW_PID_1852_BSTOCS_TRIG				(1)
#define AW_PID_1852_BSTOCS_TRIG_VALUE		\
	(AW_PID_1852_BSTOCS_TRIG << AW_PID_1852_BSTOCS_START_BIT)

/* OVPS bit 10 (SYSST 0x01) */
#define AW_PID_1852_OVPS_START_BIT		(10)
#define AW_PID_1852_OVPS_BITS_LEN		(1)
#define AW_PID_1852_OVPS_MASK			\
	(~(((1<<AW_PID_1852_OVPS_BITS_LEN)-1) << AW_PID_1852_OVPS_START_BIT))

#define AW_PID_1852_OVPS_DEFAULT_VALUE	(0)
#define AW_PID_1852_OVPS_DEFAULT		\
	(AW_PID_1852_OVPS_DEFAULT_VALUE << AW_PID_1852_OVPS_START_BIT)

/* BSTS bit 9 (SYSST 0x01) */
#define AW_PID_1852_BSTS_START_BIT		(9)
#define AW_PID_1852_BSTS_BITS_LEN		(1)
#define AW_PID_1852_BSTS_MASK			\
	(~(((1<<AW_PID_1852_BSTS_BITS_LEN)-1) << AW_PID_1852_BSTS_START_BIT))

#define AW_PID_1852_BSTS_NOT_FINISHED	(0)
#define AW_PID_1852_BSTS_NOT_FINISHED_VALUE	\
	(AW_PID_1852_BSTS_NOT_FINISHED << AW_PID_1852_BSTS_START_BIT)

#define AW_PID_1852_BSTS_FINISHED		(1)
#define AW_PID_1852_BSTS_FINISHED_VALUE	\
	(AW_PID_1852_BSTS_FINISHED << AW_PID_1852_BSTS_START_BIT)

#define AW_PID_1852_BSTS_DEFAULT_VALUE	(0)
#define AW_PID_1852_BSTS_DEFAULT		\
	(AW_PID_1852_BSTS_DEFAULT_VALUE << AW_PID_1852_BSTS_START_BIT)

/* SWS bit 8 (SYSST 0x01) */
#define AW_PID_1852_SWS_START_BIT		(8)
#define AW_PID_1852_SWS_BITS_LEN		(1)
#define AW_PID_1852_SWS_MASK			\
	(~(((1<<AW_PID_1852_SWS_BITS_LEN)-1) << AW_PID_1852_SWS_START_BIT))

#define AW_PID_1852_SWS_NOT_SWITCHING	(0)
#define AW_PID_1852_SWS_NOT_SWITCHING_VALUE	\
	(AW_PID_1852_SWS_NOT_SWITCHING << AW_PID_1852_SWS_START_BIT)

#define AW_PID_1852_SWS_SWITCHING		(1)
#define AW_PID_1852_SWS_SWITCHING_VALUE	\
	(AW_PID_1852_SWS_SWITCHING << AW_PID_1852_SWS_START_BIT)

#define AW_PID_1852_SWS_DEFAULT_VALUE	(0)
#define AW_PID_1852_SWS_DEFAULT			\
	(AW_PID_1852_SWS_DEFAULT_VALUE << AW_PID_1852_SWS_START_BIT)

/* CLIPS bit 7 (SYSST 0x01) */
#define AW_PID_1852_CLIPS_START_BIT		(7)
#define AW_PID_1852_CLIPS_BITS_LEN		(1)
#define AW_PID_1852_CLIPS_MASK			\
	(~(((1<<AW_PID_1852_CLIPS_BITS_LEN)-1) << AW_PID_1852_CLIPS_START_BIT))

#define AW_PID_1852_CLIPS_NOT_CLIPPING	(0)
#define AW_PID_1852_CLIPS_NOT_CLIPPING_VALUE	\
	(AW_PID_1852_CLIPS_NOT_CLIPPING << AW_PID_1852_CLIPS_START_BIT)

#define AW_PID_1852_CLIPS_CLIPPING		(1)
#define AW_PID_1852_CLIPS_CLIPPING_VALUE	\
	(AW_PID_1852_CLIPS_CLIPPING << AW_PID_1852_CLIPS_START_BIT)

#define AW_PID_1852_CLIPS_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLIPS_DEFAULT		\
	(AW_PID_1852_CLIPS_DEFAULT_VALUE << AW_PID_1852_CLIPS_START_BIT)

/* NOCLKS bit 5 (SYSST 0x01) */
#define AW_PID_1852_NOCLKS_START_BIT	(5)
#define AW_PID_1852_NOCLKS_BITS_LEN		(1)
#define AW_PID_1852_NOCLKS_MASK			\
	(~(((1<<AW_PID_1852_NOCLKS_BITS_LEN)-1) << AW_PID_1852_NOCLKS_START_BIT))

#define AW_PID_1852_NOCLKS_NONE				(0)
#define AW_PID_1852_NOCLKS_NONE_VALUE		\
		(AW_PID_1852_NOCLKS_NONE << AW_PID_1852_NOCLKS_START_BIT)

#define AW_PID_1852_NOCLKS_TRIG				(1)
#define AW_PID_1852_NOCLKS_TRIG_VALUE		\
	(AW_PID_1852_NOCLKS_NONE << AW_PID_1852_NOCLKS_START_BIT)

#define AW_PID_1852_NOCLKS_DEFAULT_VALUE	(0)
#define AW_PID_1852_NOCLKS_DEFAULT		\
	(AW_PID_1852_NOCLKS_DEFAULT_VALUE << AW_PID_1852_NOCLKS_START_BIT)

/* CLKS bit 4 (SYSST 0x01) */
#define AW_PID_1852_CLKS_START_BIT		(4)
#define AW_PID_1852_CLKS_BITS_LEN		(1)
#define AW_PID_1852_CLKS_MASK			\
	(~(((1<<AW_PID_1852_CLKS_BITS_LEN)-1) << AW_PID_1852_CLKS_START_BIT))

#define AW_PID_1852_CLKS_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLKS_DEFAULT		\
	(AW_PID_1852_CLKS_DEFAULT_VALUE << AW_PID_1852_CLKS_START_BIT)

#define AW_PID_1852_CLKS_TRIG				(1)
#define AW_PID_1852_CLKS_TRIG_VALUE			\
	(AW_PID_1852_CLKS_TRIG << AW_PID_1852_CLKS_START_BIT)

/* OCDS bit 3 (SYSST 0x01) */
#define AW_PID_1852_OCDS_START_BIT		(3)
#define AW_PID_1852_OCDS_BITS_LEN		(1)
#define AW_PID_1852_OCDS_MASK			\
	(~(((1<<AW_PID_1852_OCDS_BITS_LEN)-1) << AW_PID_1852_OCDS_START_BIT))

#define AW_PID_1852_OCDS_DEFAULT_VALUE	(0)
#define AW_PID_1852_OCDS_DEFAULT		\
	(AW_PID_1852_OCDS_DEFAULT_VALUE << AW_PID_1852_OCDS_START_BIT)

#define AW_PID_1852_OCDS_TRIG				(1)
#define AW_PID_1852_OCDS_TRIG_VALUE			\
	(AW_PID_1852_OCDS_TRIG << AW_PID_1852_OCDS_START_BIT)

