LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
/* CLIP_PRES bit 2 (SYSST 0x01) */
#define AW_PID_1852_CLIP_PRES_START_BIT	(2)
#define AW_PID_1852_CLIP_PRES_BITS_LEN	(1)
#define AW_PID_1852_CLIP_PRES_MASK		\
	(~(((1<<AW_PID_1852_CLIP_PRES_BITS_LEN)-1) << AW_PID_1852_CLIP_PRES_START_BIT))

#define AW_PID_1852_CLIP_PRES_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLIP_PRES_DEFAULT	\
	(AW_PID_1852_CLIP_PRES_DEFAULT_VALUE << AW_PID_1852_CLIP_PRES_START_BIT)

/* OTHS bit 1 (SYSST 0x01) */
#define AW_PID_1852_OTHS_START_BIT		(1)
#define AW_PID_1852_OTHS_BITS_LEN		(1)
#define AW_PID_1852_OTHS_MASK			\
	(~(((1<<AW_PID_1852_OTHS_BITS_LEN)-1) << AW_PID_1852_OTHS_START_BIT))

#define AW_PID_1852_OTHS_DEFAULT_VALUE	(0)
#define AW_PID_1852_OTHS_DEFAULT		\
	(AW_PID_1852_OTHS_DEFAULT_VALUE << AW_PID_1852_OTHS_START_BIT)

#define AW_PID_1852_OTHS_TRIG				(1)
#define AW_PID_1852_OTHS_TRIG_VALUE			\
		(AW_PID_1852_OTHS_TRIG << AW_PID_1852_OTHS_START_BIT)

/* PLLS bit 0 (SYSST 0x01) */
#define AW_PID_1852_PLLS_START_BIT		(0)
#define AW_PID_1852_PLLS_BITS_LEN		(1)
#define AW_PID_1852_PLLS_MASK			\
	(~(((1<<AW_PID_1852_PLLS_BITS_LEN)-1) << AW_PID_1852_PLLS_START_BIT))

#define AW_PID_1852_PLLS_UNLOCKED		(0)
#define AW_PID_1852_PLLS_UNLOCKED_VALUE	\
	(AW_PID_1852_PLLS_UNLOCKED << AW_PID_1852_PLLS_START_BIT)

#define AW_PID_1852_PLLS_LOCKED			(1)
#define AW_PID_1852_PLLS_LOCKED_VALUE	\
	(AW_PID_1852_PLLS_LOCKED << AW_PID_1852_PLLS_START_BIT)

#define AW_PID_1852_PLLS_DEFAULT_VALUE	(0)
#define AW_PID_1852_PLLS_DEFAULT		\
	(AW_PID_1852_PLLS_DEFAULT_VALUE << AW_PID_1852_PLLS_START_BIT)

#define AW_PID_1852_SYSST_CHECK_MASK \
	(~(AW_PID_1852_UVLS_VDD_BELOW_2P8V_VALUE | \
	AW_PID_1852_BSTOCS_TRIG_VALUE | \
	AW_PID_1852_BSTS_FINISHED_VALUE | \
	AW_PID_1852_SWS_SWITCHING_VALUE | \
	AW_PID_1852_NOCLKS_TRIG_VALUE | \
	AW_PID_1852_CLKS_TRIG_VALUE | \
	AW_PID_1852_OCDS_TRIG_VALUE | \
	AW_PID_1852_OTHS_TRIG_VALUE | \
	AW_PID_1852_PLLS_LOCKED_VALUE))

#define AW_PID_1852_SYSST_CHECK \
	(AW_PID_1852_BSTS_FINISHED_VALUE | \
	AW_PID_1852_SWS_SWITCHING_VALUE | \
	AW_PID_1852_CLKS_TRIG_VALUE | \
	AW_PID_1852_PLLS_LOCKED_VALUE)

#define AW_PID_1852_IIS_CHECK_MASK \
	(~(AW_PID_1852_UVLS_VDD_BELOW_2P8V_VALUE | \
	AW_PID_1852_NOCLKS_TRIG_VALUE | \
	AW_PID_1852_CLKS_TRIG_VALUE | \
	AW_PID_1852_OCDS_TRIG_VALUE | \
	AW_PID_1852_OTHS_TRIG_VALUE | \
	AW_PID_1852_PLLS_LOCKED_VALUE))

#define AW_PID_1852_IIS_CHECK \
	(AW_PID_1852_CLKS_TRIG_VALUE | \
	AW_PID_1852_PLLS_LOCKED_VALUE)

/* default value of SYSST (0x01) */
/* #define AW_PID_1852_SYSST_DEFAULT		(0x0000) */

/* SYSINT (0x02) detail */
/* OVP2I bit 15 (SYSINT 0x02) */
#define AW_PID_1852_OVP2I_START_BIT		(15)
#define AW_PID_1852_OVP2I_BITS_LEN		(1)
#define AW_PID_1852_OVP2I_MASK			\
	(~(((1<<AW_PID_1852_OVP2I_BITS_LEN)-1) << AW_PID_1852_OVP2I_START_BIT))

#define AW_PID_1852_OVP2I_DEFAULT_VALUE	(0)
#define AW_PID_1852_OVP2I_DEFAULT		\
	(AW_PID_1852_OVP2I_DEFAULT_VALUE << AW_PID_1852_OVP2I_START_BIT)

/* UVLI bit 14 (SYSINT 0x02) */
#define AW_PID_1852_UVLI_START_BIT		(14)
#define AW_PID_1852_UVLI_BITS_LEN		(1)
#define AW_PID_1852_UVLI_MASK			\
	(~(((1<<AW_PID_1852_UVLI_BITS_LEN)-1) << AW_PID_1852_UVLI_START_BIT))

#define AW_PID_1852_UVLI_DEFAULT_VALUE	(0)
#define AW_PID_1852_UVLI_DEFAULT		\
	(AW_PID_1852_UVLI_DEFAULT_VALUE << AW_PID_1852_UVLI_START_BIT)

/* ADPI bit 13 (SYSINT 0x02) */
#define AW_PID_1852_ADPI_START_BIT		(13)
#define AW_PID_1852_ADPI_BITS_LEN		(1)
#define AW_PID_1852_ADPI_MASK			\
	(~(((1<<AW_PID_1852_ADPI_BITS_LEN)-1) << AW_PID_1852_ADPI_START_BIT))

#define AW_PID_1852_ADPI_DEFAULT_VALUE	(0)
#define AW_PID_1852_ADPI_DEFAULT		\
	(AW_PID_1852_ADPI_DEFAULT_VALUE << AW_PID_1852_ADPI_START_BIT)

/* BSTOCI bit 11 (SYSINT 0x02) */
#define AW_PID_1852_BSTOCI_START_BIT	(11)
#define AW_PID_1852_BSTOCI_BITS_LEN		(1)
#define AW_PID_1852_BSTOCI_MASK			\
	(~(((1<<AW_PID_1852_BSTOCI_BITS_LEN)-1) << AW_PID_1852_BSTOCI_START_BIT))

#define AW_PID_1852_BSTOCI_DEFAULT_VALUE	(0)
#define AW_PID_1852_BSTOCI_DEFAULT		\
	(AW_PID_1852_BSTOCI_DEFAULT_VALUE << AW_PID_1852_BSTOCI_START_BIT)

/* OVPI bit 10 (SYSINT 0x02) */
#define AW_PID_1852_OVPI_START_BIT		(10)
#define AW_PID_1852_OVPI_BITS_LEN		(1)
#define AW_PID_1852_OVPI_MASK			\
	(~(((1<<AW_PID_1852_OVPI_BITS_LEN)-1) << AW_PID_1852_OVPI_START_BIT))

#define AW_PID_1852_OVPI_DEFAULT_VALUE	(0)
#define AW_PID_1852_OVPI_DEFAULT		\
	(AW_PID_1852_OVPI_DEFAULT_VALUE << AW_PID_1852_OVPI_START_BIT)

/* BSTI bit 9 (SYSINT 0x02) */
#define AW_PID_1852_BSTI_START_BIT		(9)
#define AW_PID_1852_BSTI_BITS_LEN		(1)
#define AW_PID_1852_BSTI_MASK			\
	(~(((1<<AW_PID_1852_BSTI_BITS_LEN)-1) << AW_PID_1852_BSTI_START_BIT))

#define AW_PID_1852_BSTI_DEFAULT_VALUE	(0)
#define AW_PID_1852_BSTI_DEFAULT		\
	(AW_PID_1852_BSTI_DEFAULT_VALUE << AW_PID_1852_BSTI_START_BIT)

/* SWI bit 8 (SYSINT 0x02) */
#define AW_PID_1852_SWI_START_BIT		(8)
#define AW_PID_1852_SWI_BITS_LEN		(1)
#define AW_PID_1852_SWI_MASK			\
	(~(((1<<AW_PID_1852_SWI_BITS_LEN)-1) << AW_PID_1852_SWI_START_BIT))

#define AW_PID_1852_SWI_DEFAULT_VALUE	(0)
#define AW_PID_1852_SWI_DEFAULT			\
	(AW_PID_1852_SWI_DEFAULT_VALUE << AW_PID_1852_SWI_START_BIT)

/* CLIPI bit 7 (SYSINT 0x02) */
#define AW_PID_1852_CLIPI_START_BIT		(7)
#define AW_PID_1852_CLIPI_BITS_LEN		(1)
#define AW_PID_1852_CLIPI_MASK			\
	(~(((1<<AW_PID_1852_CLIPI_BITS_LEN)-1) << AW_PID_1852_CLIPI_START_BIT))

#define AW_PID_1852_CLIPI_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLIPI_DEFAULT		\
	(AW_PID_1852_CLIPI_DEFAULT_VALUE << AW_PID_1852_CLIPI_START_BIT)

/* NOCLKI bit 5 (SYSINT 0x02) */
#define AW_PID_1852_NOCLKI_START_BIT	(5)
#define AW_PID_1852_NOCLKI_BITS_LEN		(1)
#define AW_PID_1852_NOCLKI_MASK			\
	(~(((1<<AW_PID_1852_NOCLKI_BITS_LEN)-1) << AW_PID_1852_NOCLKI_START_BIT))

#define AW_PID_1852_NOCLKI_DEFAULT_VALUE	(0)
#define AW_PID_1852_NOCLKI_DEFAULT		\
	(AW_PID_1852_NOCLKI_DEFAULT_VALUE << AW_PID_1852_NOCLKI_START_BIT)

/* CLKI bit 4 (SYSINT 0x02) */
#define AW_PID_1852_CLKI_START_BIT		(4)
#define AW_PID_1852_CLKI_BITS_LEN		(1)
#define AW_PID_1852_CLKI_MASK			\
	(~(((1<<AW_PID_1852_CLKI_BITS_LEN)-1) << AW_PID_1852_CLKI_START_BIT))

