LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_CLKI_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLKI_DEFAULT		\
	(AW_PID_1852_CLKI_DEFAULT_VALUE << AW_PID_1852_CLKI_START_BIT)

/* OCDI bit 3 (SYSINT 0x02) */
#define AW_PID_1852_OCDI_START_BIT		(3)
#define AW_PID_1852_OCDI_BITS_LEN		(1)
#define AW_PID_1852_OCDI_MASK			\
	(~(((1<<AW_PID_1852_OCDI_BITS_LEN)-1) << AW_PID_1852_OCDI_START_BIT))

#define AW_PID_1852_OCDI_DEFAULT_VALUE	(0)
#define AW_PID_1852_OCDI_DEFAULT		\
	(AW_PID_1852_OCDI_DEFAULT_VALUE << AW_PID_1852_OCDI_START_BIT)

/* CLIP_PREI bit 2 (SYSINT 0x02) */
#define AW_PID_1852_CLIP_PREI_START_BIT	(2)
#define AW_PID_1852_CLIP_PREI_BITS_LEN	(1)
#define AW_PID_1852_CLIP_PREI_MASK		\
	(~(((1<<AW_PID_1852_CLIP_PREI_BITS_LEN)-1) << AW_PID_1852_CLIP_PREI_START_BIT))

#define AW_PID_1852_CLIP_PREI_DEFAULT_VALUE	(0)
#define AW_PID_1852_CLIP_PREI_DEFAULT	\
	(AW_PID_1852_CLIP_PREI_DEFAULT_VALUE << AW_PID_1852_CLIP_PREI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_1852_OTHI_START_BIT		(1)
#define AW_PID_1852_OTHI_BITS_LEN		(1)
#define AW_PID_1852_OTHI_MASK			\
	(~(((1<<AW_PID_1852_OTHI_BITS_LEN)-1) << AW_PID_1852_OTHI_START_BIT))

#define AW_PID_1852_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_1852_OTHI_DEFAULT		\
	(AW_PID_1852_OTHI_DEFAULT_VALUE << AW_PID_1852_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_1852_PLLI_START_BIT		(0)
#define AW_PID_1852_PLLI_BITS_LEN		(1)
#define AW_PID_1852_PLLI_MASK			\
	(~(((1<<AW_PID_1852_PLLI_BITS_LEN)-1) << AW_PID_1852_PLLI_START_BIT))

#define AW_PID_1852_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_1852_PLLI_DEFAULT		\
	(AW_PID_1852_PLLI_DEFAULT_VALUE << AW_PID_1852_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_1852_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_1852_OVP2M_START_BIT		(15)
#define AW_PID_1852_OVP2M_BITS_LEN		(1)
#define AW_PID_1852_OVP2M_MASK			\
	(~(((1<<AW_PID_1852_OVP2M_BITS_LEN)-1) << AW_PID_1852_OVP2M_START_BIT))

#define AW_PID_1852_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_1852_OVP2M_DEFAULT		\
	(AW_PID_1852_OVP2M_DEFAULT_VALUE << AW_PID_1852_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_1852_UVLM_START_BIT		(14)
#define AW_PID_1852_UVLM_BITS_LEN		(1)
#define AW_PID_1852_UVLM_MASK			\
	(~(((1<<AW_PID_1852_UVLM_BITS_LEN)-1) << AW_PID_1852_UVLM_START_BIT))

#define AW_PID_1852_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_1852_UVLM_DEFAULT		\
	(AW_PID_1852_UVLM_DEFAULT_VALUE << AW_PID_1852_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_1852_ADPM_START_BIT		(13)
#define AW_PID_1852_ADPM_BITS_LEN		(1)
#define AW_PID_1852_ADPM_MASK			\
	(~(((1<<AW_PID_1852_ADPM_BITS_LEN)-1) << AW_PID_1852_ADPM_START_BIT))

#define AW_PID_1852_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_1852_ADPM_DEFAULT		\
	(AW_PID_1852_ADPM_DEFAULT_VALUE << AW_PID_1852_ADPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_1852_BSTOCM_START_BIT	(11)
#define AW_PID_1852_BSTOCM_BITS_LEN		(1)
#define AW_PID_1852_BSTOCM_MASK			\
	(~(((1<<AW_PID_1852_BSTOCM_BITS_LEN)-1) << AW_PID_1852_BSTOCM_START_BIT))

#define AW_PID_1852_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_1852_BSTOCM_DEFAULT		\
	(AW_PID_1852_BSTOCM_DEFAULT_VALUE << AW_PID_1852_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_1852_OVPM_START_BIT		(10)
#define AW_PID_1852_OVPM_BITS_LEN		(1)
#define AW_PID_1852_OVPM_MASK			\
	(~(((1<<AW_PID_1852_OVPM_BITS_LEN)-1) << AW_PID_1852_OVPM_START_BIT))

#define AW_PID_1852_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_1852_OVPM_DEFAULT		\
	(AW_PID_1852_OVPM_DEFAULT_VALUE << AW_PID_1852_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_1852_BSTM_START_BIT		(9)
#define AW_PID_1852_BSTM_BITS_LEN		(1)
#define AW_PID_1852_BSTM_MASK			\
	(~(((1<<AW_PID_1852_BSTM_BITS_LEN)-1) << AW_PID_1852_BSTM_START_BIT))

#define AW_PID_1852_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_1852_BSTM_DEFAULT		\
	(AW_PID_1852_BSTM_DEFAULT_VALUE << AW_PID_1852_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_1852_SWM_START_BIT		(8)
#define AW_PID_1852_SWM_BITS_LEN		(1)
#define AW_PID_1852_SWM_MASK			\
	(~(((1<<AW_PID_1852_SWM_BITS_LEN)-1) << AW_PID_1852_SWM_START_BIT))

#define AW_PID_1852_SWM_DEFAULT_VALUE	(1)
#define AW_PID_1852_SWM_DEFAULT			\
	(AW_PID_1852_SWM_DEFAULT_VALUE << AW_PID_1852_SWM_START_BIT)

/* CLIPM bit 7 (SYSINTM 0x03) */
#define AW_PID_1852_CLIPM_START_BIT		(7)
#define AW_PID_1852_CLIPM_BITS_LEN		(1)
#define AW_PID_1852_CLIPM_MASK			\
	(~(((1<<AW_PID_1852_CLIPM_BITS_LEN)-1) << AW_PID_1852_CLIPM_START_BIT))

#define AW_PID_1852_CLIPM_DEFAULT_VALUE	(1)
#define AW_PID_1852_CLIPM_DEFAULT		\
	(AW_PID_1852_CLIPM_DEFAULT_VALUE << AW_PID_1852_CLIPM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_1852_NOCLKM_START_BIT	(5)
#define AW_PID_1852_NOCLKM_BITS_LEN		(1)
#define AW_PID_1852_NOCLKM_MASK			\
	(~(((1<<AW_PID_1852_NOCLKM_BITS_LEN)-1) << AW_PID_1852_NOCLKM_START_BIT))

#define AW_PID_1852_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_1852_NOCLKM_DEFAULT		\
	(AW_PID_1852_NOCLKM_DEFAULT_VALUE << AW_PID_1852_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_1852_CLKM_START_BIT		(4)
#define AW_PID_1852_CLKM_BITS_LEN		(1)
#define AW_PID_1852_CLKM_MASK			\
	(~(((1<<AW_PID_1852_CLKM_BITS_LEN)-1) << AW_PID_1852_CLKM_START_BIT))

#define AW_PID_1852_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_1852_CLKM_DEFAULT		\
	(AW_PID_1852_CLKM_DEFAULT_VALUE << AW_PID_1852_CLKM_START_BIT)

/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_1852_OCDM_START_BIT		(3)
#define AW_PID_1852_OCDM_BITS_LEN		(1)
#define AW_PID_1852_OCDM_MASK			\
	(~(((1<<AW_PID_1852_OCDM_BITS_LEN)-1) << AW_PID_1852_OCDM_START_BIT))

#define AW_PID_1852_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_1852_OCDM_DEFAULT		\
	(AW_PID_1852_OCDM_DEFAULT_VALUE << AW_PID_1852_OCDM_START_BIT)

/* CLIP_PREM bit 2 (SYSINTM 0x03) */
#define AW_PID_1852_CLIP_PREM_START_BIT	(2)
#define AW_PID_1852_CLIP_PREM_BITS_LEN	(1)
#define AW_PID_1852_CLIP_PREM_MASK		\
	(~(((1<<AW_PID_1852_CLIP_PREM_BITS_LEN)-1) << AW_PID_1852_CLIP_PREM_START_BIT))

#define AW_PID_1852_CLIP_PREM_DEFAULT_VALUE	(1)
#define AW_PID_1852_CLIP_PREM_DEFAULT	\
	(AW_PID_1852_CLIP_PREM_DEFAULT_VALUE << AW_PID_1852_CLIP_PREM_START_BIT)

