LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_1852_OTHM_START_BIT		(1)
#define AW_PID_1852_OTHM_BITS_LEN		(1)
#define AW_PID_1852_OTHM_MASK			\
	(~(((1<<AW_PID_1852_OTHM_BITS_LEN)-1) << AW_PID_1852_OTHM_START_BIT))

#define AW_PID_1852_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_1852_OTHM_DEFAULT		\
	(AW_PID_1852_OTHM_DEFAULT_VALUE << AW_PID_1852_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_1852_PLLM_START_BIT		(0)
#define AW_PID_1852_PLLM_BITS_LEN		(1)
#define AW_PID_1852_PLLM_MASK			\
	(~(((1<<AW_PID_1852_PLLM_BITS_LEN)-1) << AW_PID_1852_PLLM_START_BIT))

#define AW_PID_1852_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_1852_PLLM_DEFAULT		\
	(AW_PID_1852_PLLM_DEFAULT_VALUE << AW_PID_1852_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
#define  AW_PID_1852_SYSINTM_DEFAULT		(0xEFBF)

/* SYSCTRL (0x04) detail */
/* SPK_GAIN bit 14:12 (SYSCTRL 0x04) */
#define AW_PID_1852_SPK_GAIN_START_BIT	(12)
#define AW_PID_1852_SPK_GAIN_BITS_LEN	(3)
#define AW_PID_1852_SPK_GAIN_MASK		\
	(~(((1<<AW_PID_1852_SPK_GAIN_BITS_LEN)-1) << AW_PID_1852_SPK_GAIN_START_BIT))

#define AW_PID_1852_SPK_GAIN_AV7		(0)
#define AW_PID_1852_SPK_GAIN_AV7_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV7 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_AV8		(1)
#define AW_PID_1852_SPK_GAIN_AV8_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV8 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_AV10		(2)
#define AW_PID_1852_SPK_GAIN_AV10_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV10 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_AV14		(3)
#define AW_PID_1852_SPK_GAIN_AV14_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV14 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_AV16		(4)
#define AW_PID_1852_SPK_GAIN_AV16_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV16 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_AV20		(5)
#define AW_PID_1852_SPK_GAIN_AV20_VALUE	\
	(AW_PID_1852_SPK_GAIN_AV20 << AW_PID_1852_SPK_GAIN_START_BIT)

#define AW_PID_1852_SPK_GAIN_DEFAULT_VALUE	(0x4)
#define AW_PID_1852_SPK_GAIN_DEFAULT	\
	(AW_PID_1852_SPK_GAIN_DEFAULT_VALUE << AW_PID_1852_SPK_GAIN_START_BIT)

/* RCV_GAIN bit 11:10 (SYSCTRL 0x04) */
#define AW_PID_1852_RCV_GAIN_START_BIT	(10)
#define AW_PID_1852_RCV_GAIN_BITS_LEN	(2)
#define AW_PID_1852_RCV_GAIN_MASK		\
	(~(((1<<AW_PID_1852_RCV_GAIN_BITS_LEN)-1) << AW_PID_1852_RCV_GAIN_START_BIT))

#define AW_PID_1852_RCV_GAIN_AV4P5		(0)
#define AW_PID_1852_RCV_GAIN_AV4P5_VALUE	\
	(AW_PID_1852_RCV_GAIN_AV4P5 << AW_PID_1852_RCV_GAIN_START_BIT)

#define AW_PID_1852_RCV_GAIN_AV5		(1)
#define AW_PID_1852_RCV_GAIN_AV5_VALUE	\
	(AW_PID_1852_RCV_GAIN_AV5 << AW_PID_1852_RCV_GAIN_START_BIT)

#define AW_PID_1852_RCV_GAIN_AV5P5		(2)
#define AW_PID_1852_RCV_GAIN_AV5P5_VALUE	\
	(AW_PID_1852_RCV_GAIN_AV5P5 << AW_PID_1852_RCV_GAIN_START_BIT)

#define AW_PID_1852_RCV_GAIN_AV7P5		(3)
#define AW_PID_1852_RCV_GAIN_AV7P5_VALUE	\
	(AW_PID_1852_RCV_GAIN_AV7P5 << AW_PID_1852_RCV_GAIN_START_BIT)

#define AW_PID_1852_RCV_GAIN_DEFAULT_VALUE	(0)
#define AW_PID_1852_RCV_GAIN_DEFAULT	\
	(AW_PID_1852_RCV_GAIN_DEFAULT_VALUE << AW_PID_1852_RCV_GAIN_START_BIT)

/* INTMODE bit 9 (SYSCTRL 0x04) */
#define AW_PID_1852_INTMODE_START_BIT	(9)
#define AW_PID_1852_INTMODE_BITS_LEN	(1)
#define AW_PID_1852_INTMODE_MASK		\
	(~(((1<<AW_PID_1852_INTMODE_BITS_LEN)-1) << AW_PID_1852_INTMODE_START_BIT))

#define AW_PID_1852_INTMODE_OPENMINUS_DRAIN	(0)
#define AW_PID_1852_INTMODE_OPENMINUS_DRAIN_VALUE	\
	(AW_PID_1852_INTMODE_OPENMINUS_DRAIN << AW_PID_1852_INTMODE_START_BIT)

#define AW_PID_1852_INTMODE_PUSHPULL	(1)
#define AW_PID_1852_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_1852_INTMODE_PUSHPULL << AW_PID_1852_INTMODE_START_BIT)

#define AW_PID_1852_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_1852_INTMODE_DEFAULT		\
	(AW_PID_1852_INTMODE_DEFAULT_VALUE << AW_PID_1852_INTMODE_START_BIT)

/* INTN bit 8 (SYSCTRL 0x04) */
#define AW_PID_1852_INTN_START_BIT		(8)
#define AW_PID_1852_INTN_BITS_LEN		(1)
#define AW_PID_1852_INTN_MASK			\
	(~(((1<<AW_PID_1852_INTN_BITS_LEN)-1) << AW_PID_1852_INTN_START_BIT))

#define AW_PID_1852_INTN_SYSINT			(0)
#define AW_PID_1852_INTN_SYSINT_VALUE	\
	(AW_PID_1852_INTN_SYSINT << AW_PID_1852_INTN_START_BIT)

#define AW_PID_1852_INTN_SYSST			(1)
#define AW_PID_1852_INTN_SYSST_VALUE	\
	(AW_PID_1852_INTN_SYSST << AW_PID_1852_INTN_START_BIT)

#define AW_PID_1852_INTN_DEFAULT_VALUE	(0)
#define AW_PID_1852_INTN_DEFAULT		\
	(AW_PID_1852_INTN_DEFAULT_VALUE << AW_PID_1852_INTN_START_BIT)

/* RCV_MODE bit 7 (SYSCTRL 0x04) */
#define AW_PID_1852_RCV_MODE_START_BIT	(7)
#define AW_PID_1852_RCV_MODE_BITS_LEN	(1)
#define AW_PID_1852_RCV_MODE_MASK		\
	(~(((1<<AW_PID_1852_RCV_MODE_BITS_LEN)-1) << AW_PID_1852_RCV_MODE_START_BIT))

#define AW_PID_1852_RCV_MODE_SPEAKER	(0)
#define AW_PID_1852_RCV_MODE_SPEAKER_MODE	\
	(AW_PID_1852_RCV_MODE_SPEAKER << AW_PID_1852_RCV_MODE_START_BIT)

#define AW_PID_1852_RCV_MODE_RECEIVER	(1)
#define AW_PID_1852_RCV_MODE_RECEIVER_MODE	\
	(AW_PID_1852_RCV_MODE_RECEIVER << AW_PID_1852_RCV_MODE_START_BIT)

#define AW_PID_1852_RCV_MODE_DEFAULT_VALUE	(0)
#define AW_PID_1852_RCV_MODE_DEFAULT	\
	(AW_PID_1852_RCV_MODE_DEFAULT_VALUE << AW_PID_1852_RCV_MODE_START_BIT)

/* I2SEN bit 6 (SYSCTRL 0x04) */
#define AW_PID_1852_I2SEN_START_BIT		(6)
#define AW_PID_1852_I2SEN_BITS_LEN		(1)
#define AW_PID_1852_I2SEN_MASK			\
	(~(((1<<AW_PID_1852_I2SEN_BITS_LEN)-1) << AW_PID_1852_I2SEN_START_BIT))

#define AW_PID_1852_I2SEN_DISABLE		(0)
#define AW_PID_1852_I2SEN_DISABLE_VALUE	\
	(AW_PID_1852_I2SEN_DISABLE << AW_PID_1852_I2SEN_START_BIT)

#define AW_PID_1852_I2SEN_ENABLE		(1)
#define AW_PID_1852_I2SEN_ENABLE_VALUE	\
	(AW_PID_1852_I2SEN_ENABLE << AW_PID_1852_I2SEN_START_BIT)

#define AW_PID_1852_I2SEN_DEFAULT_VALUE	(0)
#define AW_PID_1852_I2SEN_DEFAULT		\
	(AW_PID_1852_I2SEN_DEFAULT_VALUE << AW_PID_1852_I2SEN_START_BIT)

/* WSINV bit 5 (SYSCTRL 0x04) */
#define AW_PID_1852_WSINV_START_BIT		(5)
#define AW_PID_1852_WSINV_BITS_LEN		(1)
#define AW_PID_1852_WSINV_MASK			\
	(~(((1<<AW_PID_1852_WSINV_BITS_LEN)-1) << AW_PID_1852_WSINV_START_BIT))

#define AW_PID_1852_WSINV_NO_SWITCH		(0)
#define AW_PID_1852_WSINV_NO_SWITCH_VALUE	\
	(AW_PID_1852_WSINV_NO_SWITCH << AW_PID_1852_WSINV_START_BIT)

#define AW_PID_1852_WSINV_LEFTRIGHT_SWITCH	(1)
#define AW_PID_1852_WSINV_LEFTRIGHT_SWITCH_VALUE	\
	(AW_PID_1852_WSINV_LEFTRIGHT_SWITCH << AW_PID_1852_WSINV_START_BIT)

#define AW_PID_1852_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_1852_WSINV_DEFAULT		\
	(AW_PID_1852_WSINV_DEFAULT_VALUE << AW_PID_1852_WSINV_START_BIT)

