LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
/* BCKINV bit 4 (SYSCTRL 0x04) */
#define AW_PID_1852_BCKINV_START_BIT	(4)
#define AW_PID_1852_BCKINV_BITS_LEN		(1)
#define AW_PID_1852_BCKINV_MASK			\
	(~(((1<<AW_PID_1852_BCKINV_BITS_LEN)-1) << AW_PID_1852_BCKINV_START_BIT))

#define AW_PID_1852_BCKINV_NOT_INVERT	(0)
#define AW_PID_1852_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_1852_BCKINV_NOT_INVERT << AW_PID_1852_BCKINV_START_BIT)

#define AW_PID_1852_BCKINV_INVERTED		(1)
#define AW_PID_1852_BCKINV_INVERTED_VALUE	\
	(AW_PID_1852_BCKINV_INVERTED << AW_PID_1852_BCKINV_START_BIT)

#define AW_PID_1852_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_1852_BCKINV_DEFAULT		\
	(AW_PID_1852_BCKINV_DEFAULT_VALUE << AW_PID_1852_BCKINV_START_BIT)

/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_1852_IPLL_START_BIT		(3)
#define AW_PID_1852_IPLL_BITS_LEN		(1)
#define AW_PID_1852_IPLL_MASK			\
	(~(((1<<AW_PID_1852_IPLL_BITS_LEN)-1) << AW_PID_1852_IPLL_START_BIT))

#define AW_PID_1852_IPLL_BIT_CLOCK		(0)
#define AW_PID_1852_IPLL_BIT_CLOCK_VALUE	\
	(AW_PID_1852_IPLL_BIT_CLOCK << AW_PID_1852_IPLL_START_BIT)

#define AW_PID_1852_IPLL_WORD_SELECTION_SIGNAL	(1)
#define AW_PID_1852_IPLL_WORD_SELECTION_SIGNAL_VALUE	\
	(AW_PID_1852_IPLL_WORD_SELECTION_SIGNAL << AW_PID_1852_IPLL_START_BIT)

#define AW_PID_1852_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_1852_IPLL_DEFAULT		\
	(AW_PID_1852_IPLL_DEFAULT_VALUE << AW_PID_1852_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_1852_AMPPD_START_BIT		(1)
#define AW_PID_1852_AMPPD_BITS_LEN		(1)
#define AW_PID_1852_AMPPD_MASK			\
	(~(((1<<AW_PID_1852_AMPPD_BITS_LEN)-1) << AW_PID_1852_AMPPD_START_BIT))

#define AW_PID_1852_AMPPD_NORMAL_WORKING	(0)
#define AW_PID_1852_AMPPD_NORMAL_WORKING_VALUE	\
	(AW_PID_1852_AMPPD_NORMAL_WORKING << AW_PID_1852_AMPPD_START_BIT)

#define AW_PID_1852_AMPPD_POWER_DOWN	(1)
#define AW_PID_1852_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_1852_AMPPD_POWER_DOWN << AW_PID_1852_AMPPD_START_BIT)

#define AW_PID_1852_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_1852_AMPPD_DEFAULT		\
	(AW_PID_1852_AMPPD_DEFAULT_VALUE << AW_PID_1852_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_1852_PWDN_START_BIT			(0)
#define AW_PID_1852_PWDN_BITS_LEN			(1)
#define AW_PID_1852_PWDN_MASK				\
	(~(((1<<AW_PID_1852_PWDN_BITS_LEN)-1)<<AW_PID_1852_PWDN_START_BIT))

#define AW_PID_1852_PWDN_NORMAL_WORKING		(0)
#define AW_PID_1852_PWDN_NORMAL_WORKING_VALUE	\
	(AW_PID_1852_PWDN_NORMAL_WORKING << AW_PID_1852_PWDN_START_BIT)
#define AW_PID_1852_PWDN_POWER_DOWN			(1)
#define AW_PID_1852_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_1852_PWDN_POWER_DOWN << AW_PID_1852_PWDN_START_BIT)

#define AW_PID_1852_PWDN_DEFAULT_VALUE		(1)
#define AW_PID_1852_PWDN_DEFAULT			\
	(AW_PID_1852_PWDN_DEFAULT_VALUE<<AW_PID_1852_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_1852_SYSCTRL_DEFAULT		(0x4003) */

/* SYSCTRL2 (0x05) detail */
/* RMSE bit 7 (SYSCTRL2 0x05) */
#define AW_PID_1852_RMSE_START_BIT		(7)
#define AW_PID_1852_RMSE_BITS_LEN		(1)
#define AW_PID_1852_RMSE_MASK			\
	(~(((1<<AW_PID_1852_RMSE_BITS_LEN)-1) << AW_PID_1852_RMSE_START_BIT))

#define AW_PID_1852_RMSE_DISABLE		(0)
#define AW_PID_1852_RMSE_DISABLE_VALUE	\
	(AW_PID_1852_RMSE_DISABLE << AW_PID_1852_RMSE_START_BIT)

#define AW_PID_1852_RMSE_ENABLE			(1)
#define AW_PID_1852_RMSE_ENABLE_VALUE	\
	(AW_PID_1852_RMSE_ENABLE << AW_PID_1852_RMSE_START_BIT)

#define AW_PID_1852_RMSE_DEFAULT_VALUE	(0)
#define AW_PID_1852_RMSE_DEFAULT		\
	(AW_PID_1852_RMSE_DEFAULT_VALUE << AW_PID_1852_RMSE_START_BIT)

/* HAGCE bit 6 (SYSCTRL2 0x05) */
#define AW_PID_1852_HAGCE_START_BIT		(6)
#define AW_PID_1852_HAGCE_BITS_LEN		(1)
#define AW_PID_1852_HAGCE_MASK			\
	(~(((1<<AW_PID_1852_HAGCE_BITS_LEN)-1) << AW_PID_1852_HAGCE_START_BIT))

#define AW_PID_1852_HAGCE_DISABLE		(0)
#define AW_PID_1852_HAGCE_DISABLE_VALUE	\
	(AW_PID_1852_HAGCE_DISABLE << AW_PID_1852_HAGCE_START_BIT)

#define AW_PID_1852_HAGCE_ENABLE		(1)
#define AW_PID_1852_HAGCE_ENABLE_VALUE	\
	(AW_PID_1852_HAGCE_ENABLE << AW_PID_1852_HAGCE_START_BIT)

#define AW_PID_1852_HAGCE_DEFAULT_VALUE	(0)
#define AW_PID_1852_HAGCE_DEFAULT		\
	(AW_PID_1852_HAGCE_DEFAULT_VALUE << AW_PID_1852_HAGCE_START_BIT)

/* HDCCE bit 5 (SYSCTRL2 0x05) */
#define AW_PID_1852_HDCCE_START_BIT		(5)
#define AW_PID_1852_HDCCE_BITS_LEN		(1)
#define AW_PID_1852_HDCCE_MASK			\
	(~(((1<<AW_PID_1852_HDCCE_BITS_LEN)-1) << AW_PID_1852_HDCCE_START_BIT))

#define AW_PID_1852_HDCCE_DISABLE		(0)
#define AW_PID_1852_HDCCE_DISABLE_VALUE	\
	(AW_PID_1852_HDCCE_DISABLE << AW_PID_1852_HDCCE_START_BIT)

#define AW_PID_1852_HDCCE_ENABLE		(1)
#define AW_PID_1852_HDCCE_ENABLE_VALUE	\
	(AW_PID_1852_HDCCE_ENABLE << AW_PID_1852_HDCCE_START_BIT)

#define AW_PID_1852_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_1852_HDCCE_DEFAULT		\
	(AW_PID_1852_HDCCE_DEFAULT_VALUE << AW_PID_1852_HDCCE_START_BIT)

/* HMUTE bit 4 (SYSCTRL2 0x05) */
#define AW_PID_1852_HMUTE_START_BIT		(4)
#define AW_PID_1852_HMUTE_BITS_LEN		(1)
#define AW_PID_1852_HMUTE_MASK			\
	(~(((1<<AW_PID_1852_HMUTE_BITS_LEN)-1) << AW_PID_1852_HMUTE_START_BIT))

#define AW_PID_1852_HMUTE_DISABLE		(0)
#define AW_PID_1852_HMUTE_DISABLE_VALUE	\
	(AW_PID_1852_HMUTE_DISABLE << AW_PID_1852_HMUTE_START_BIT)

#define AW_PID_1852_HMUTE_ENABLE		(1)
#define AW_PID_1852_HMUTE_ENABLE_VALUE	\
	(AW_PID_1852_HMUTE_ENABLE << AW_PID_1852_HMUTE_START_BIT)

#define AW_PID_1852_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_1852_HMUTE_DEFAULT		\
	(AW_PID_1852_HMUTE_DEFAULT_VALUE << AW_PID_1852_HMUTE_START_BIT)

/* BST_IPEAK bit 3:0 (SYSCTRL2 0x05) */
#define AW_PID_1852_BST_IPEAK_START_BIT	(0)
#define AW_PID_1852_BST_IPEAK_BITS_LEN	(4)
#define AW_PID_1852_BST_IPEAK_MASK		\
	(~(((1<<AW_PID_1852_BST_IPEAK_BITS_LEN)-1) << AW_PID_1852_BST_IPEAK_START_BIT))

#define AW_PID_1852_BST_IPEAK_1P5A		(0)
#define AW_PID_1852_BST_IPEAK_1P5A_VALUE	\
	(AW_PID_1852_BST_IPEAK_1P5A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_1P75A		(1)
#define AW_PID_1852_BST_IPEAK_1P75A_VALUE	\
	(AW_PID_1852_BST_IPEAK_1P75A << AW_PID_1852_BST_IPEAK_START_BIT)

