LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_BST_IPEAK_2P0A		(2)
#define AW_PID_1852_BST_IPEAK_2P0A_VALUE	\
	(AW_PID_1852_BST_IPEAK_2P0A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_2P25A		(3)
#define AW_PID_1852_BST_IPEAK_2P25A_VALUE	\
	(AW_PID_1852_BST_IPEAK_2P25A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_2P5A		(4)
#define AW_PID_1852_BST_IPEAK_2P5A_VALUE	\
	(AW_PID_1852_BST_IPEAK_2P5A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_2P75A		(5)
#define AW_PID_1852_BST_IPEAK_2P75A_VALUE	\
	(AW_PID_1852_BST_IPEAK_2P75A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_3P0A		(6)
#define AW_PID_1852_BST_IPEAK_3P0A_VALUE	\
	(AW_PID_1852_BST_IPEAK_3P0A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_3P25A		(7)
#define AW_PID_1852_BST_IPEAK_3P25A_VALUE	\
	(AW_PID_1852_BST_IPEAK_3P25A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_3P5A		(8)
#define AW_PID_1852_BST_IPEAK_3P5A_VALUE	\
	(AW_PID_1852_BST_IPEAK_3P5A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_3P75A		(9)
#define AW_PID_1852_BST_IPEAK_3P75A_VALUE	\
	(AW_PID_1852_BST_IPEAK_3P75A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_4A		(10)
#define AW_PID_1852_BST_IPEAK_4A_VALUE	\
	(AW_PID_1852_BST_IPEAK_4A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_4P25A		(11)
#define AW_PID_1852_BST_IPEAK_4P25A_VALUE	\
	(AW_PID_1852_BST_IPEAK_4P25A << AW_PID_1852_BST_IPEAK_START_BIT)

#define AW_PID_1852_BST_IPEAK_DEFAULT_VALUE	(8)
#define AW_PID_1852_BST_IPEAK_DEFAULT	\
	(AW_PID_1852_BST_IPEAK_DEFAULT_VALUE << AW_PID_1852_BST_IPEAK_START_BIT)

/* default value of SYSCTRL2 (0x05) */
/* #define AW_PID_1852_SYSCTRL2_DEFAULT		(0x0038) */

/* I2SCTRL (0x06) detail */
/* INPLEV bit 13 (I2SCTRL 0x06) */
#define AW_PID_1852_INPLEV_START_BIT	(13)
#define AW_PID_1852_INPLEV_BITS_LEN		(1)
#define AW_PID_1852_INPLEV_MASK			\
	(~(((1<<AW_PID_1852_INPLEV_BITS_LEN)-1) << AW_PID_1852_INPLEV_START_BIT))

#define AW_PID_1852_INPLEV_NOT_ATTENUATED	(0)
#define AW_PID_1852_INPLEV_NOT_ATTENUATED_VALUE	\
	(AW_PID_1852_INPLEV_NOT_ATTENUATED << AW_PID_1852_INPLEV_START_BIT)

#define AW_PID_1852_INPLEV_ATTENUATED_BY_MINUS_6DB	(1)
#define AW_PID_1852_INPLEV_ATTENUATED_BY_MINUS_6DB_VALUE	\
	(AW_PID_1852_INPLEV_ATTENUATED_BY_MINUS_6DB << AW_PID_1852_INPLEV_START_BIT)

#define AW_PID_1852_INPLEV_DEFAULT_VALUE	(0)
#define AW_PID_1852_INPLEV_DEFAULT		\
	(AW_PID_1852_INPLEV_DEFAULT_VALUE << AW_PID_1852_INPLEV_START_BIT)

/* I2SRXEN bit 12 (I2SCTRL 0x06) */
#define AW_PID_1852_I2SRXEN_START_BIT	(12)
#define AW_PID_1852_I2SRXEN_BITS_LEN	(1)
#define AW_PID_1852_I2SRXEN_MASK		\
	(~(((1<<AW_PID_1852_I2SRXEN_BITS_LEN)-1) << AW_PID_1852_I2SRXEN_START_BIT))

#define AW_PID_1852_I2SRXEN_DISABLE		(0)
#define AW_PID_1852_I2SRXEN_DISABLE_VALUE	\
	(AW_PID_1852_I2SRXEN_DISABLE << AW_PID_1852_I2SRXEN_START_BIT)

#define AW_PID_1852_I2SRXEN_ENABLE		(1)
#define AW_PID_1852_I2SRXEN_ENABLE_VALUE	\
	(AW_PID_1852_I2SRXEN_ENABLE << AW_PID_1852_I2SRXEN_START_BIT)

#define AW_PID_1852_I2SRXEN_DEFAULT_VALUE	(1)
#define AW_PID_1852_I2SRXEN_DEFAULT		\
	(AW_PID_1852_I2SRXEN_DEFAULT_VALUE << AW_PID_1852_I2SRXEN_START_BIT)

/* CHSEL bit 11:10 (I2SCTRL 0x06) */
#define AW_PID_1852_CHSEL_START_BIT		(10)
#define AW_PID_1852_CHSEL_BITS_LEN		(2)
#define AW_PID_1852_CHSEL_MASK			\
	(~(((1<<AW_PID_1852_CHSEL_BITS_LEN)-1) << AW_PID_1852_CHSEL_START_BIT))

#define AW_PID_1852_CHSEL_RESERVED		(0)
#define AW_PID_1852_CHSEL_RESERVED_VALUE	\
	(AW_PID_1852_CHSEL_RESERVED << AW_PID_1852_CHSEL_START_BIT)

#define AW_PID_1852_CHSEL_LEFT			(1)
#define AW_PID_1852_CHSEL_LEFT_VALUE	\
	(AW_PID_1852_CHSEL_LEFT << AW_PID_1852_CHSEL_START_BIT)

#define AW_PID_1852_CHSEL_RIGHT			(2)
#define AW_PID_1852_CHSEL_RIGHT_VALUE	\
	(AW_PID_1852_CHSEL_RIGHT << AW_PID_1852_CHSEL_START_BIT)

#define AW_PID_1852_CHSEL_MONO_LR2		(3)
#define AW_PID_1852_CHSEL_MONO_LR2_VALUE	\
	(AW_PID_1852_CHSEL_MONO_LR2 << AW_PID_1852_CHSEL_START_BIT)

#define AW_PID_1852_CHSEL_DEFAULT_VALUE	(1)
#define AW_PID_1852_CHSEL_DEFAULT		\
	(AW_PID_1852_CHSEL_DEFAULT_VALUE << AW_PID_1852_CHSEL_START_BIT)

/* I2SMD bit 9:8 (I2SCTRL 0x06) */
#define AW_PID_1852_I2SMD_START_BIT		(8)
#define AW_PID_1852_I2SMD_BITS_LEN		(2)
#define AW_PID_1852_I2SMD_MASK			\
	(~(((1<<AW_PID_1852_I2SMD_BITS_LEN)-1) << AW_PID_1852_I2SMD_START_BIT))

#define AW_PID_1852_I2SMD_PHILIP_STANDARD_I2S_DEFAULT	(0)
#define AW_PID_1852_I2SMD_PHILIP_STANDARD_I2S_DEFAULT_VALUE	\
	(AW_PID_1852_I2SMD_PHILIP_STANDARD_I2S_DEFAULT << AW_PID_1852_I2SMD_START_BIT)

#define AW_PID_1852_I2SMD_MSB_JUSTIFIED	(1)
#define AW_PID_1852_I2SMD_MSB_JUSTIFIED_VALUE	\
	(AW_PID_1852_I2SMD_MSB_JUSTIFIED << AW_PID_1852_I2SMD_START_BIT)

#define AW_PID_1852_I2SMD_LSB_JUSTIFIED	(2)
#define AW_PID_1852_I2SMD_LSB_JUSTIFIED_VALUE	\
	(AW_PID_1852_I2SMD_LSB_JUSTIFIED << AW_PID_1852_I2SMD_START_BIT)

#define AW_PID_1852_I2SMD_RESERVED		(3)
#define AW_PID_1852_I2SMD_RESERVED_VALUE	\
	(AW_PID_1852_I2SMD_RESERVED << AW_PID_1852_I2SMD_START_BIT)

#define AW_PID_1852_I2SMD_DEFAULT_VALUE	(0)
#define AW_PID_1852_I2SMD_DEFAULT		\
	(AW_PID_1852_I2SMD_DEFAULT_VALUE << AW_PID_1852_I2SMD_START_BIT)

/* I2SFS bit 7:6 (I2SCTRL 0x06) */
#define AW_PID_1852_I2SFS_START_BIT		(6)
#define AW_PID_1852_I2SFS_BITS_LEN		(2)
#define AW_PID_1852_I2SFS_MASK			\
	(~(((1<<AW_PID_1852_I2SFS_BITS_LEN)-1) << AW_PID_1852_I2SFS_START_BIT))

#define AW_PID_1852_I2SFS_16_BITS		(0)
#define AW_PID_1852_I2SFS_16_BITS_VALUE	\
	(AW_PID_1852_I2SFS_16_BITS << AW_PID_1852_I2SFS_START_BIT)

#define AW_PID_1852_I2SFS_20_BITS		(1)
#define AW_PID_1852_I2SFS_20_BITS_VALUE	\
	(AW_PID_1852_I2SFS_20_BITS << AW_PID_1852_I2SFS_START_BIT)

#define AW_PID_1852_I2SFS_24_BITS		(2)
#define AW_PID_1852_I2SFS_24_BITS_VALUE	\
	(AW_PID_1852_I2SFS_24_BITS << AW_PID_1852_I2SFS_START_BIT)

#define AW_PID_1852_I2SFS_32_BITS		(3)
#define AW_PID_1852_I2SFS_32_BITS_VALUE	\
	(AW_PID_1852_I2SFS_32_BITS << AW_PID_1852_I2SFS_START_BIT)

#define AW_PID_1852_I2SFS_DEFAULT_VALUE	(3)
#define AW_PID_1852_I2SFS_DEFAULT		\
	(AW_PID_1852_I2SFS_DEFAULT_VALUE << AW_PID_1852_I2SFS_START_BIT)

/* I2SBCK bit 5:4 (I2SCTRL 0x06) */
#define AW_PID_1852_I2SBCK_START_BIT	(4)
#define AW_PID_1852_I2SBCK_BITS_LEN		(2)
#define AW_PID_1852_I2SBCK_MASK			\
	(~(((1<<AW_PID_1852_I2SBCK_BITS_LEN)-1) << AW_PID_1852_I2SBCK_START_BIT))

