LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_I2SBCK_32FS162		(0)
#define AW_PID_1852_I2SBCK_32FS162_VALUE	\
	(AW_PID_1852_I2SBCK_32FS162 << AW_PID_1852_I2SBCK_START_BIT)

#define AW_PID_1852_I2SBCK_48FS242		(1)
#define AW_PID_1852_I2SBCK_48FS242_VALUE	\
	(AW_PID_1852_I2SBCK_48FS242 << AW_PID_1852_I2SBCK_START_BIT)

#define AW_PID_1852_I2SBCK_64FS322		(2)
#define AW_PID_1852_I2SBCK_64FS322_VALUE	\
	(AW_PID_1852_I2SBCK_64FS322 << AW_PID_1852_I2SBCK_START_BIT)

#define AW_PID_1852_I2SBCK_RESERVED		(3)
#define AW_PID_1852_I2SBCK_RESERVED_VALUE	\
	(AW_PID_1852_I2SBCK_RESERVED << AW_PID_1852_I2SBCK_START_BIT)

#define AW_PID_1852_I2SBCK_DEFAULT_VALUE	(2)
#define AW_PID_1852_I2SBCK_DEFAULT		\
	(AW_PID_1852_I2SBCK_DEFAULT_VALUE << AW_PID_1852_I2SBCK_START_BIT)

/* I2SSR bit 3:0 (I2SCTRL 0x06) */
#define AW_PID_1852_I2SSR_START_BIT		(0)
#define AW_PID_1852_I2SSR_BITS_LEN		(4)
#define AW_PID_1852_I2SSR_MASK			\
	(~(((1<<AW_PID_1852_I2SSR_BITS_LEN)-1) << AW_PID_1852_I2SSR_START_BIT))

#define AW_PID_1852_I2SSR_8_KHZ			(0)
#define AW_PID_1852_I2SSR_8_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_8_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_11P025_KHZ	(1)
#define AW_PID_1852_I2SSR_11P025_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_11P025_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_12_KHZ		(2)
#define AW_PID_1852_I2SSR_12_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_12_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_16_KHZ		(3)
#define AW_PID_1852_I2SSR_16_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_16_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_22P05KHZ		(4)
#define AW_PID_1852_I2SSR_22P05KHZ_VALUE	\
	(AW_PID_1852_I2SSR_22P05KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_24_KHZ		(5)
#define AW_PID_1852_I2SSR_24_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_24_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_32_KHZ		(6)
#define AW_PID_1852_I2SSR_32_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_32_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_44P1_KHZ		(7)
#define AW_PID_1852_I2SSR_44P1_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_44P1_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_48_KHZ		(8)
#define AW_PID_1852_I2SSR_48_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_48_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_96_KHZ		(9)
#define AW_PID_1852_I2SSR_96_KHZ_VALUE	\
	(AW_PID_1852_I2SSR_96_KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_192KHZ		(10)
#define AW_PID_1852_I2SSR_192KHZ_VALUE	\
	(AW_PID_1852_I2SSR_192KHZ << AW_PID_1852_I2SSR_START_BIT)

#define AW_PID_1852_I2SSR_DEFAULT_VALUE	(8)
#define AW_PID_1852_I2SSR_DEFAULT		\
	(AW_PID_1852_I2SSR_DEFAULT_VALUE << AW_PID_1852_I2SSR_START_BIT)

/* default value of I2SCTRL (0x06) */
/* #define AW_PID_1852_I2SCTRL_DEFAULT		(0x14E8) */

/* I2SCFG1 (0x07) detail */
/* I2S_TX_SLOTVLD bit 13:12 (I2SCFG1 0x07) */
#define AW_PID_1852_I2S_TX_SLOTVLD_START_BIT	(12)
#define AW_PID_1852_I2S_TX_SLOTVLD_BITS_LEN	(2)
#define AW_PID_1852_I2S_TX_SLOTVLD_MASK	\
	(~(((1<<AW_PID_1852_I2S_TX_SLOTVLD_BITS_LEN)-1) << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT))

#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_0	(0)
#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_0_VALUE	\
	(AW_PID_1852_I2S_TX_SLOTVLD_SLOT_0 << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_1	(1)
#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_1_VALUE	\
	(AW_PID_1852_I2S_TX_SLOTVLD_SLOT_1 << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_2	(2)
#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_2_VALUE	\
	(AW_PID_1852_I2S_TX_SLOTVLD_SLOT_2 << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_3	(3)
#define AW_PID_1852_I2S_TX_SLOTVLD_SLOT_3_VALUE	\
	(AW_PID_1852_I2S_TX_SLOTVLD_SLOT_3 << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_TX_SLOTVLD_DEFAULT_VALUE	(0)
#define AW_PID_1852_I2S_TX_SLOTVLD_DEFAULT	\
	(AW_PID_1852_I2S_TX_SLOTVLD_DEFAULT_VALUE << AW_PID_1852_I2S_TX_SLOTVLD_START_BIT)

/* I2S_RX_SLOTVLD bit 11:8 (I2SCFG1 0x07) */
#define AW_PID_1852_I2S_RX_SLOTVLD_START_BIT	(8)
#define AW_PID_1852_I2S_RX_SLOTVLD_BITS_LEN	(4)
#define AW_PID_1852_I2S_RX_SLOTVLD_MASK	\
	(~(((1<<AW_PID_1852_I2S_RX_SLOTVLD_BITS_LEN)-1) << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT))

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_1	(3)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_1_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_1 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_2	(5)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_2_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_2 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_3	(9)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_3_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_0_AND_3 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_2	(6)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_2_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_2 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_3	(10)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_3_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_1_AND_3 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_2_AND_3	(12)
#define AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_2_AND_3_VALUE	\
	(AW_PID_1852_I2S_RX_SLOTVLD_SLOTS_2_AND_3 << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

#define AW_PID_1852_I2S_RX_SLOTVLD_DEFAULT_VALUE	(3)
#define AW_PID_1852_I2S_RX_SLOTVLD_DEFAULT	\
	(AW_PID_1852_I2S_RX_SLOTVLD_DEFAULT_VALUE << AW_PID_1852_I2S_RX_SLOTVLD_START_BIT)

/* CFSEL bit 7:6 (I2SCFG1 0x07) */
#define AW_PID_1852_CFSEL_START_BIT		(6)
#define AW_PID_1852_CFSEL_BITS_LEN		(2)
#define AW_PID_1852_CFSEL_MASK			\
	(~(((1<<AW_PID_1852_CFSEL_BITS_LEN)-1) << AW_PID_1852_CFSEL_START_BIT))

#define AW_PID_1852_CFSEL_HAGC_DATA		(0)
#define AW_PID_1852_CFSEL_HAGC_DATA_VALUE	\
	(AW_PID_1852_CFSEL_HAGC_DATA << AW_PID_1852_CFSEL_START_BIT)

#define AW_PID_1852_CFSEL_IV_SENSE_DATA	(1)
#define AW_PID_1852_CFSEL_IV_SENSE_DATA_VALUE	\
	(AW_PID_1852_CFSEL_IV_SENSE_DATA << AW_PID_1852_CFSEL_START_BIT)

