LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_CFSEL_IVT_DATA_MAPPING_ACCORDING_TO_I2S_AUDIO_RES	(2)
#define AW_PID_1852_CFSEL_IVT_DATA_MAPPING_ACCORDING_TO_I2S_AUDIO_RES_VALUE	\
	(AW_PID_1852_CFSEL_IVT_DATA_MAPPING_ACCORDING_TO_I2S_AUDIO_RES << AW_PID_1852_CFSEL_START_BIT)

#define AW_PID_1852_CFSEL_IVT_DATA_MAPPING_AS__I_PVDD_VBAT_V_T_SYNC	(3)
#define AW_PID_1852_CFSEL_IVT_DATA_MAPPING_AS__I_PVDD_VBAT_V_T_SYNC_VALUE	\
	(AW_PID_1852_CFSEL_IVT_DATA_MAPPING_AS__I_PVDD_VBAT_V_T_SYNC << AW_PID_1852_CFSEL_START_BIT)

#define AW_PID_1852_CFSEL_DEFAULT_VALUE	(0)
#define AW_PID_1852_CFSEL_DEFAULT		\
	(AW_PID_1852_CFSEL_DEFAULT_VALUE << AW_PID_1852_CFSEL_START_BIT)

/* DRVSTREN bit 5 (I2SCFG1 0x07) */
#define AW_PID_1852_DRVSTREN_START_BIT	(5)
#define AW_PID_1852_DRVSTREN_BITS_LEN	(1)
#define AW_PID_1852_DRVSTREN_MASK		\
	(~(((1<<AW_PID_1852_DRVSTREN_BITS_LEN)-1) << AW_PID_1852_DRVSTREN_START_BIT))

#define AW_PID_1852_DRVSTREN_2MA		(0)
#define AW_PID_1852_DRVSTREN_2MA_VALUE	\
	(AW_PID_1852_DRVSTREN_2MA << AW_PID_1852_DRVSTREN_START_BIT)

#define AW_PID_1852_DRVSTREN_8MA		(1)
#define AW_PID_1852_DRVSTREN_8MA_VALUE	\
	(AW_PID_1852_DRVSTREN_8MA << AW_PID_1852_DRVSTREN_START_BIT)

#define AW_PID_1852_DRVSTREN_DEFAULT_VALUE	(1)
#define AW_PID_1852_DRVSTREN_DEFAULT	\
	(AW_PID_1852_DRVSTREN_DEFAULT_VALUE << AW_PID_1852_DRVSTREN_START_BIT)

/* DOHZ bit 4 (I2SCFG1 0x07) */
#define AW_PID_1852_DOHZ_START_BIT		(4)
#define AW_PID_1852_DOHZ_BITS_LEN		(1)
#define AW_PID_1852_DOHZ_MASK			\
	(~(((1<<AW_PID_1852_DOHZ_BITS_LEN)-1) << AW_PID_1852_DOHZ_START_BIT))

#define AW_PID_1852_DOHZ_ALL_CHANNELS_AVAILABLE	(0)
#define AW_PID_1852_DOHZ_ALL_CHANNELS_AVAILABLE_VALUE	\
	(AW_PID_1852_DOHZ_ALL_CHANNELS_AVAILABLE << AW_PID_1852_DOHZ_START_BIT)

#define AW_PID_1852_DOHZ_HIZ			(1)
#define AW_PID_1852_DOHZ_HIZ_VALUE		\
	(AW_PID_1852_DOHZ_HIZ << AW_PID_1852_DOHZ_START_BIT)

#define AW_PID_1852_DOHZ_DEFAULT_VALUE	(1)
#define AW_PID_1852_DOHZ_DEFAULT		\
	(AW_PID_1852_DOHZ_DEFAULT_VALUE << AW_PID_1852_DOHZ_START_BIT)

/* FSYNC_TYPE bit 3 (I2SCFG1 0x07) */
#define AW_PID_1852_FSYNC_TYPE_START_BIT	(3)
#define AW_PID_1852_FSYNC_TYPE_BITS_LEN	(1)
#define AW_PID_1852_FSYNC_TYPE_MASK		\
	(~(((1<<AW_PID_1852_FSYNC_TYPE_BITS_LEN)-1) << AW_PID_1852_FSYNC_TYPE_START_BIT))

#define AW_PID_1852_FSYNC_TYPE_ONE_SLOT_WIDTH	(0)
#define AW_PID_1852_FSYNC_TYPE_ONE_SLOT_WIDTH_VALUE	\
	(AW_PID_1852_FSYNC_TYPE_ONE_SLOT_WIDTH << AW_PID_1852_FSYNC_TYPE_START_BIT)

#define AW_PID_1852_FSYNC_TYPE_ONE_BCK_CLOCK_CYCLE	(1)
#define AW_PID_1852_FSYNC_TYPE_ONE_BCK_CLOCK_CYCLE_VALUE	\
	(AW_PID_1852_FSYNC_TYPE_ONE_BCK_CLOCK_CYCLE << AW_PID_1852_FSYNC_TYPE_START_BIT)

#define AW_PID_1852_FSYNC_TYPE_DEFAULT_VALUE	(0)
#define AW_PID_1852_FSYNC_TYPE_DEFAULT	\
	(AW_PID_1852_FSYNC_TYPE_DEFAULT_VALUE << AW_PID_1852_FSYNC_TYPE_START_BIT)

/* SLOT_NUM bit 2 (I2SCFG1 0x07) */
#define AW_PID_1852_SLOT_NUM_START_BIT	(2)
#define AW_PID_1852_SLOT_NUM_BITS_LEN	(1)
#define AW_PID_1852_SLOT_NUM_MASK		\
	(~(((1<<AW_PID_1852_SLOT_NUM_BITS_LEN)-1) << AW_PID_1852_SLOT_NUM_START_BIT))

#define AW_PID_1852_SLOT_NUM_2_SLOTS	(0)
#define AW_PID_1852_SLOT_NUM_2_SLOTS_VALUE	\
	(AW_PID_1852_SLOT_NUM_2_SLOTS << AW_PID_1852_SLOT_NUM_START_BIT)

#define AW_PID_1852_SLOT_NUM_4_SLOTS	(1)
#define AW_PID_1852_SLOT_NUM_4_SLOTS_VALUE	\
	(AW_PID_1852_SLOT_NUM_4_SLOTS << AW_PID_1852_SLOT_NUM_START_BIT)

#define AW_PID_1852_SLOT_NUM_DEFAULT_VALUE	(0)
#define AW_PID_1852_SLOT_NUM_DEFAULT	\
	(AW_PID_1852_SLOT_NUM_DEFAULT_VALUE << AW_PID_1852_SLOT_NUM_START_BIT)

/* I2SCHS bit 1 (I2SCFG1 0x07) */
#define AW_PID_1852_I2SCHS_START_BIT	(1)
#define AW_PID_1852_I2SCHS_BITS_LEN		(1)
#define AW_PID_1852_I2SCHS_MASK			\
	(~(((1<<AW_PID_1852_I2SCHS_BITS_LEN)-1) << AW_PID_1852_I2SCHS_START_BIT))

#define AW_PID_1852_I2SCHS_LEFT_CHANNEL	(0)
#define AW_PID_1852_I2SCHS_LEFT_CHANNEL_VALUE	\
	(AW_PID_1852_I2SCHS_LEFT_CHANNEL << AW_PID_1852_I2SCHS_START_BIT)

#define AW_PID_1852_I2SCHS_RIGHT_CHANNEL	(1)
#define AW_PID_1852_I2SCHS_RIGHT_CHANNEL_VALUE	\
	(AW_PID_1852_I2SCHS_RIGHT_CHANNEL << AW_PID_1852_I2SCHS_START_BIT)

#define AW_PID_1852_I2SCHS_DEFAULT_VALUE	(0)
#define AW_PID_1852_I2SCHS_DEFAULT		\
	(AW_PID_1852_I2SCHS_DEFAULT_VALUE << AW_PID_1852_I2SCHS_START_BIT)

/* I2STXEN bit 0 (I2SCFG1 0x07) */
#define AW_PID_1852_I2STXEN_START_BIT	(0)
#define AW_PID_1852_I2STXEN_BITS_LEN	(1)
#define AW_PID_1852_I2STXEN_MASK		\
	(~(((1<<AW_PID_1852_I2STXEN_BITS_LEN)-1) << AW_PID_1852_I2STXEN_START_BIT))

#define AW_PID_1852_I2STXEN_DISABLE		(0)
#define AW_PID_1852_I2STXEN_DISABLE_VALUE	\
	(AW_PID_1852_I2STXEN_DISABLE << AW_PID_1852_I2STXEN_START_BIT)

#define AW_PID_1852_I2STXEN_ENABLE		(1)
#define AW_PID_1852_I2STXEN_ENABLE_VALUE	\
	(AW_PID_1852_I2STXEN_ENABLE << AW_PID_1852_I2STXEN_START_BIT)

#define AW_PID_1852_I2STXEN_DEFAULT_VALUE	(0)
#define AW_PID_1852_I2STXEN_DEFAULT		\
	(AW_PID_1852_I2STXEN_DEFAULT_VALUE << AW_PID_1852_I2STXEN_START_BIT)

/* default value of I2SCFG1 (0x07) */
/* #define AW_PID_1852_I2SCFG1_DEFAULT		(0x0330) */

/* HAGCCFG1 (0x09) detail */
/* RVTH bit 15:8 (HAGCCFG1 0x09) */
#define AW_PID_1852_RVTH_START_BIT		(8)
#define AW_PID_1852_RVTH_BITS_LEN		(8)
#define AW_PID_1852_RVTH_MASK			\
	(~(((1<<AW_PID_1852_RVTH_BITS_LEN)-1) << AW_PID_1852_RVTH_START_BIT))

#define AW_PID_1852_RVTH_DEFAULT_VALUE	(0x39)
#define AW_PID_1852_RVTH_DEFAULT		\
	(AW_PID_1852_RVTH_DEFAULT_VALUE << AW_PID_1852_RVTH_START_BIT)

/* AVTH bit 7:0 (HAGCCFG1 0x09) */
#define AW_PID_1852_AVTH_START_BIT		(0)
#define AW_PID_1852_AVTH_BITS_LEN		(8)
#define AW_PID_1852_AVTH_MASK			\
	(~(((1<<AW_PID_1852_AVTH_BITS_LEN)-1) << AW_PID_1852_AVTH_START_BIT))

#define AW_PID_1852_AVTH_DEFAULT_VALUE	(0x40)
#define AW_PID_1852_AVTH_DEFAULT		\
	(AW_PID_1852_AVTH_DEFAULT_VALUE << AW_PID_1852_AVTH_START_BIT)

/* default value of HAGCCFG1 (0x09) */
/* #define AW_PID_1852_HAGCCFG1_DEFAULT		(0x3940) */

/* HAGCCFG2 (0x0A) detail */
/* ATTH bit 15:0 (HAGCCFG2 0x0A) */
#define AW_PID_1852_ATTH_START_BIT		(0)
#define AW_PID_1852_ATTH_BITS_LEN		(16)
#define AW_PID_1852_ATTH_MASK			\
	(~(((1<<AW_PID_1852_ATTH_BITS_LEN)-1) << AW_PID_1852_ATTH_START_BIT))

