LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_ATTH_RESERVED		(0)
#define AW_PID_1852_ATTH_RESERVED_VALUE	\
	(AW_PID_1852_ATTH_RESERVED << AW_PID_1852_ATTH_START_BIT)

#define AW_PID_1852_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_1852_ATTH_DEFAULT		\
	(AW_PID_1852_ATTH_DEFAULT_VALUE << AW_PID_1852_ATTH_START_BIT)

/* default value of HAGCCFG2 (0x0A) */
/* #define AW_PID_1852_HAGCCFG2_DEFAULT		(0x0030) */

/* HAGCCFG3 (0x0B) detail */
/* RTTH bit 15:0 (HAGCCFG3 0x0B) */
#define AW_PID_1852_RTTH_START_BIT		(0)
#define AW_PID_1852_RTTH_BITS_LEN		(16)
#define AW_PID_1852_RTTH_MASK			\
	(~(((1<<AW_PID_1852_RTTH_BITS_LEN)-1) << AW_PID_1852_RTTH_START_BIT))

#define AW_PID_1852_RTTH_RESERVED		(0)
#define AW_PID_1852_RTTH_RESERVED_VALUE	\
	(AW_PID_1852_RTTH_RESERVED << AW_PID_1852_RTTH_START_BIT)

#define AW_PID_1852_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_1852_RTTH_DEFAULT		\
	(AW_PID_1852_RTTH_DEFAULT_VALUE << AW_PID_1852_RTTH_START_BIT)

/* I2S CCO_UMX */
#define AW_PID_1852_I2S_CCO_MUX_START_BIT		(14)
#define AW_PID_1852_I2S_CCO_MUX_BITS_LEN		(1)
#define AW_PID_1852_I2S_CCO_MUX_MASK			\
	(~(((1<<AW_PID_1852_I2S_CCO_MUX_BITS_LEN)-1)<<AW_PID_1852_I2S_CCO_MUX_START_BIT))

#define AW_PID_1852_I2S_CCO_MUX_8_16_32KHZ_BIT_VALUE		(0)
#define AW_PID_1852_I2S_CCO_MUX_8_16_32KHZ_VALUE			\
	(AW_PID_1852_I2S_CCO_MUX_8_16_32KHZ_BIT_VALUE<<AW_PID_1852_I2S_CCO_MUX_START_BIT)


#define AW_PID_1852_I2S_CCO_MUX_EXC_8_16_32KHZ_BIT_VALUE	(1)
#define AW_PID_1852_I2S_CCO_MUX_EXC_8_16_32KHZ_VALUE			\
	(AW_PID_1852_I2S_CCO_MUX_EXC_8_16_32KHZ_BIT_VALUE<<AW_PID_1852_I2S_CCO_MUX_START_BIT)

/* default value of HAGCCFG3 (0x0B) */
/* #define AW_PID_1852_HAGCCFG3_DEFAULT		(0x01E0) */

/* HAGCCFG4 (0x0C) detail */
/* VOL bit 15:8 (HAGCCFG4 0x0C) */
#define AW_PID_1852_MUTE_VOL  (90 * 2)
#define AW_PID_1852_VOL_STEP_DB   (6 * 2)

#define AW_PID_1852_VOL_START_BIT		(8)
#define AW_PID_1852_VOL_BITS_LEN		(8)
#define AW_PID_1852_VOL_MASK			\
	(~(((1<<AW_PID_1852_VOL_BITS_LEN)-1) << AW_PID_1852_VOL_START_BIT))

#define AW_PID_1852_VOL_DEFAULT_VALUE	(0)
#define AW_PID_1852_VOL_DEFAULT			\
	(AW_PID_1852_VOL_DEFAULT_VALUE << AW_PID_1852_VOL_START_BIT)

/* HOLDTH bit 7:0 (HAGCCFG4 0x0C) */
#define AW_PID_1852_HOLDTH_START_BIT	(0)
#define AW_PID_1852_HOLDTH_BITS_LEN		(8)
#define AW_PID_1852_HOLDTH_MASK			\
	(~(((1<<AW_PID_1852_HOLDTH_BITS_LEN)-1) << AW_PID_1852_HOLDTH_START_BIT))

#define AW_PID_1852_HOLDTH_RESERVED		(0)
#define AW_PID_1852_HOLDTH_RESERVED_VALUE	\
	(AW_PID_1852_HOLDTH_RESERVED << AW_PID_1852_HOLDTH_START_BIT)

#define AW_PID_1852_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_1852_HOLDTH_DEFAULT		\
	(AW_PID_1852_HOLDTH_DEFAULT_VALUE << AW_PID_1852_HOLDTH_START_BIT)

/* default value of HAGCCFG4 (0x0C) */
/* #define AW_PID_1852_HAGCCFG4_DEFAULT		(0x0064) */

/* HAGCST (0x10) detail */
/* SPK_GAIN_ST bit 10:8 (HAGCST 0x10) */
#define AW_PID_1852_SPK_GAIN_ST_START_BIT	(8)
#define AW_PID_1852_SPK_GAIN_ST_BITS_LEN	(3)
#define AW_PID_1852_SPK_GAIN_ST_MASK	\
	(~(((1<<AW_PID_1852_SPK_GAIN_ST_BITS_LEN)-1) << AW_PID_1852_SPK_GAIN_ST_START_BIT))

#define AW_PID_1852_SPK_GAIN_ST_AV7		(0)
#define AW_PID_1852_SPK_GAIN_ST_AV7_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV7 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_AV8		(1)
#define AW_PID_1852_SPK_GAIN_ST_AV8_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV8 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_AV10	(2)
#define AW_PID_1852_SPK_GAIN_ST_AV10_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV10 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_AV14	(3)
#define AW_PID_1852_SPK_GAIN_ST_AV14_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV14 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_AV16	(4)
#define AW_PID_1852_SPK_GAIN_ST_AV16_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV16 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_AV20	(5)
#define AW_PID_1852_SPK_GAIN_ST_AV20_VALUE	\
	(AW_PID_1852_SPK_GAIN_ST_AV20 << AW_PID_1852_SPK_GAIN_ST_START_BIT)

#define AW_PID_1852_SPK_GAIN_ST_DEFAULT_VALUE	(0)
#define AW_PID_1852_SPK_GAIN_ST_DEFAULT	\
	(AW_PID_1852_SPK_GAIN_ST_DEFAULT_VALUE << AW_PID_1852_SPK_GAIN_ST_START_BIT)

/* BSTVOUT_ST bit 5:0 (HAGCST 0x10) */
#define AW_PID_1852_BSTVOUT_ST_START_BIT	(0)
#define AW_PID_1852_BSTVOUT_ST_BITS_LEN	(6)
#define AW_PID_1852_BSTVOUT_ST_MASK		\
	(~(((1<<AW_PID_1852_BSTVOUT_ST_BITS_LEN)-1) << AW_PID_1852_BSTVOUT_ST_START_BIT))

#define AW_PID_1852_BSTVOUT_ST_3P125V	(0)
#define AW_PID_1852_BSTVOUT_ST_3P125V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P125V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_3P25V	(1)
#define AW_PID_1852_BSTVOUT_ST_3P25V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P25V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_3P375V	(2)
#define AW_PID_1852_BSTVOUT_ST_3P375V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P375V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_3P5V		(3)
#define AW_PID_1852_BSTVOUT_ST_3P5V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P5V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_3P625V	(4)
#define AW_PID_1852_BSTVOUT_ST_3P625V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P625V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_3P75V	(5)
#define AW_PID_1852_BSTVOUT_ST_3P75V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_3P75V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_11V		(63)
#define AW_PID_1852_BSTVOUT_ST_11V_VALUE	\
	(AW_PID_1852_BSTVOUT_ST_11V << AW_PID_1852_BSTVOUT_ST_START_BIT)

#define AW_PID_1852_BSTVOUT_ST_DEFAULT_VALUE	(0)
#define AW_PID_1852_BSTVOUT_ST_DEFAULT	\
	(AW_PID_1852_BSTVOUT_ST_DEFAULT_VALUE << AW_PID_1852_BSTVOUT_ST_START_BIT)

/* default value of HAGCST (0x10) */
/* #define AW_PID_1852_HAGCST_DEFAULT		(0x0000) */

/* VBAT (0x12) detail */
/* VBAT_DET bit 9:0 (VBAT 0x12) */
#define AW_PID_1852_VBAT_DET_START_BIT	(0)
#define AW_PID_1852_VBAT_DET_BITS_LEN	(10)
#define AW_PID_1852_VBAT_DET_MASK		\
	(~(((1<<AW_PID_1852_VBAT_DET_BITS_LEN)-1) << AW_PID_1852_VBAT_DET_START_BIT))

#define AW_PID_1852_VBAT_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_1852_VBAT_DET_DEFAULT	\
	(AW_PID_1852_VBAT_DET_DEFAULT_VALUE << AW_PID_1852_VBAT_DET_START_BIT)

/* default value of VBAT (0x12) */
/* #define AW_PID_1852_VBAT_DEFAULT		(0x0263) */

/* TEMP (0x13) detail */
/* TEMP_DET bit 9:0 (TEMP 0x13) */
#define AW_PID_1852_TEMP_DET_START_BIT	(0)
#define AW_PID_1852_TEMP_DET_BITS_LEN	(10)
#define AW_PID_1852_TEMP_DET_MASK		\
	(~(((1<<AW_PID_1852_TEMP_DET_BITS_LEN)-1) << AW_PID_1852_TEMP_DET_START_BIT))

#define AW_PID_1852_TEMP_DET_MINUS_40DEGREE	(0x3D8)
#define AW_PID_1852_TEMP_DET_MINUS_40DEGREE_VALUE	\
	(AW_PID_1852_TEMP_DET_MINUS_40DEGREE << AW_PID_1852_TEMP_DET_START_BIT)

