LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_TEMP_DET_0_DEGREE	(0x00)
#define AW_PID_1852_TEMP_DET_0_DEGREE_VALUE	\
	(AW_PID_1852_TEMP_DET_0_DEGREE << AW_PID_1852_TEMP_DET_START_BIT)

#define AW_PID_1852_TEMP_DET_1_DEGREE	(0x01)
#define AW_PID_1852_TEMP_DET_1_DEGREE_VALUE	\
	(AW_PID_1852_TEMP_DET_1_DEGREE << AW_PID_1852_TEMP_DET_START_BIT)

#define AW_PID_1852_TEMP_DET_25_DEGREE	(0x19)
#define AW_PID_1852_TEMP_DET_25_DEGREE_VALUE	\
	(AW_PID_1852_TEMP_DET_25_DEGREE << AW_PID_1852_TEMP_DET_START_BIT)

#define AW_PID_1852_TEMP_DET_55_DEGREE	(0x37)
#define AW_PID_1852_TEMP_DET_55_DEGREE_VALUE	\
	(AW_PID_1852_TEMP_DET_55_DEGREE << AW_PID_1852_TEMP_DET_START_BIT)

#define AW_PID_1852_TEMP_DET_DEFAULT_VALUE	(0x019)
#define AW_PID_1852_TEMP_DET_DEFAULT	\
	(AW_PID_1852_TEMP_DET_DEFAULT_VALUE << AW_PID_1852_TEMP_DET_START_BIT)

/* default value of TEMP (0x13) */
/* #define AW_PID_1852_TEMP_DEFAULT		(0x0019) */

/* PVDD (0x14) detail */
/* PVDD_DET bit 9:0 (PVDD 0x14) */
#define AW_PID_1852_PVDD_DET_START_BIT	(0)
#define AW_PID_1852_PVDD_DET_BITS_LEN	(10)
#define AW_PID_1852_PVDD_DET_MASK		\
	(~(((1<<AW_PID_1852_PVDD_DET_BITS_LEN)-1) << AW_PID_1852_PVDD_DET_START_BIT))

#define AW_PID_1852_PVDD_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_1852_PVDD_DET_DEFAULT	\
	(AW_PID_1852_PVDD_DET_DEFAULT_VALUE << AW_PID_1852_PVDD_DET_START_BIT)

/* default value of PVDD (0x14) */
/* #define AW_PID_1852_PVDD_DEFAULT		(0x0263) */

/* BSTCTRL1 (0x60) detail */
/* BST_RTH bit 13:8 (BSTCTRL1 0x60) */
#define AW_PID_1852_BST_RTH_START_BIT	(8)
#define AW_PID_1852_BST_RTH_BITS_LEN	(6)
#define AW_PID_1852_BST_RTH_MASK		\
	(~(((1<<AW_PID_1852_BST_RTH_BITS_LEN)-1) << AW_PID_1852_BST_RTH_START_BIT))

#define AW_PID_1852_BST_RTH_DEFAULT_VALUE	(4)
#define AW_PID_1852_BST_RTH_DEFAULT		\
	(AW_PID_1852_BST_RTH_DEFAULT_VALUE << AW_PID_1852_BST_RTH_START_BIT)

/* BST_ATH bit 5:0 (BSTCTRL1 0x60) */
#define AW_PID_1852_BST_ATH_START_BIT	(0)
#define AW_PID_1852_BST_ATH_BITS_LEN	(6)
#define AW_PID_1852_BST_ATH_MASK		\
	(~(((1<<AW_PID_1852_BST_ATH_BITS_LEN)-1) << AW_PID_1852_BST_ATH_START_BIT))

#define AW_PID_1852_BST_ATH_DEFAULT_VALUE	(2)
#define AW_PID_1852_BST_ATH_DEFAULT		\
	(AW_PID_1852_BST_ATH_DEFAULT_VALUE << AW_PID_1852_BST_ATH_START_BIT)

/* default value of BSTCTRL1 (0x60) */
/* #define AW_PID_1852_BSTCTRL1_DEFAULT		(0x0402) */

/* BSTCTRL2 (0x61) detail */
/* VOUT_CTMD bit 15 (BSTCTRL2 0x61) */
#define AW_PID_1852_VOUT_CTMD_START_BIT	(15)
#define AW_PID_1852_VOUT_CTMD_BITS_LEN	(1)
#define AW_PID_1852_VOUT_CTMD_MASK		\
	(~(((1<<AW_PID_1852_VOUT_CTMD_BITS_LEN)-1) << AW_PID_1852_VOUT_CTMD_START_BIT))

#define AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VREF_125MVSTEP	(0)
#define AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VREF_125MVSTEP_VALUE	\
	(AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VREF_125MVSTEP << AW_PID_1852_VOUT_CTMD_START_BIT)

#define AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VFB_4_LEVELS	(1)
#define AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VFB_4_LEVELS_VALUE	\
	(AW_PID_1852_VOUT_CTMD_PVDD_CONTROLLED_BY_VFB_4_LEVELS << AW_PID_1852_VOUT_CTMD_START_BIT)

#define AW_PID_1852_VOUT_CTMD_DEFAULT_VALUE	(0)
#define AW_PID_1852_VOUT_CTMD_DEFAULT	\
	(AW_PID_1852_VOUT_CTMD_DEFAULT_VALUE << AW_PID_1852_VOUT_CTMD_START_BIT)

/* BST_MODE bit 14:12 (BSTCTRL2 0x61) */
#define AW_PID_1852_BST_MODE_START_BIT	(12)
#define AW_PID_1852_BST_MODE_BITS_LEN	(3)
#define AW_PID_1852_BST_MODE_MASK		\
	(~(((1<<AW_PID_1852_BST_MODE_BITS_LEN)-1) << AW_PID_1852_BST_MODE_START_BIT))

#define AW_PID_1852_BST_MODE_TRANSPARENT_MODE	(0)
#define AW_PID_1852_BST_MODE_TRANSPARENT_MODE_VALUE	\
	(AW_PID_1852_BST_MODE_TRANSPARENT_MODE << AW_PID_1852_BST_MODE_START_BIT)

#define AW_PID_1852_BST_MODE_FORCE_BOOST_MODE	(1)
#define AW_PID_1852_BST_MODE_FORCE_BOOST_MODE_VALUE	\
	(AW_PID_1852_BST_MODE_FORCE_BOOST_MODE << AW_PID_1852_BST_MODE_START_BIT)

#define AW_PID_1852_BST_MODE_TEST_BOOST_MODE	(3)
#define AW_PID_1852_BST_MODE_TEST_BOOST_MODE_VALUE	\
	(AW_PID_1852_BST_MODE_TEST_BOOST_MODE << AW_PID_1852_BST_MODE_START_BIT)

#define AW_PID_1852_BST_MODE_CLASS_G_MODE	(5)
#define AW_PID_1852_BST_MODE_CLASS_G_MODE_VALUE	\
	(AW_PID_1852_BST_MODE_CLASS_G_MODE << AW_PID_1852_BST_MODE_START_BIT)

#define AW_PID_1852_BST_MODE_DEFAULT_VALUE	(0x6)
#define AW_PID_1852_BST_MODE_DEFAULT	\
	(AW_PID_1852_BST_MODE_DEFAULT_VALUE << AW_PID_1852_BST_MODE_START_BIT)

/* BST_TDEG bit 10:8 (BSTCTRL2 0x61) */
#define AW_PID_1852_BST_TDEG_START_BIT	(8)
#define AW_PID_1852_BST_TDEG_BITS_LEN	(3)
#define AW_PID_1852_BST_TDEG_MASK		\
	(~(((1<<AW_PID_1852_BST_TDEG_BITS_LEN)-1) << AW_PID_1852_BST_TDEG_START_BIT))

#define AW_PID_1852_BST_TDEG_0P33_MS	(0)
#define AW_PID_1852_BST_TDEG_0P33_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_0P33_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_1P40_MS	(1)
#define AW_PID_1852_BST_TDEG_1P40_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_1P40_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_5P60_MS	(2)
#define AW_PID_1852_BST_TDEG_5P60_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_5P60_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_21P30_MS	(3)
#define AW_PID_1852_BST_TDEG_21P30_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_21P30_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_44_MS		(4)
#define AW_PID_1852_BST_TDEG_44_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_44_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_88_MS		(5)
#define AW_PID_1852_BST_TDEG_88_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_88_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_352_MS		(6)
#define AW_PID_1852_BST_TDEG_352_MS_VALUE	\
	(AW_PID_1852_BST_TDEG_352_MS << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_1P4_S		(7)
#define AW_PID_1852_BST_TDEG_1P4_S_VALUE	\
	(AW_PID_1852_BST_TDEG_1P4_S << AW_PID_1852_BST_TDEG_START_BIT)

#define AW_PID_1852_BST_TDEG_DEFAULT_VALUE	(0x6)
#define AW_PID_1852_BST_TDEG_DEFAULT	\
	(AW_PID_1852_BST_TDEG_DEFAULT_VALUE << AW_PID_1852_BST_TDEG_START_BIT)

/* VOUT_VFBSET bit 7:6 (BSTCTRL2 0x61) */
#define AW_PID_1852_VOUT_VFBSET_START_BIT	(6)
#define AW_PID_1852_VOUT_VFBSET_BITS_LEN	(2)
#define AW_PID_1852_VOUT_VFBSET_MASK	\
	(~(((1<<AW_PID_1852_VOUT_VFBSET_BITS_LEN)-1) << AW_PID_1852_VOUT_VFBSET_START_BIT))

