LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263/aw882xx_pid_1852_reg.h
#define AW_PID_1852_VOUT_VFBSET_8P5V	(0)
#define AW_PID_1852_VOUT_VFBSET_8P5V_VALUE	\
	(AW_PID_1852_VOUT_VFBSET_8P5V << AW_PID_1852_VOUT_VFBSET_START_BIT)

#define AW_PID_1852_VOUT_VFBSET_9P5V	(1)
#define AW_PID_1852_VOUT_VFBSET_9P5V_VALUE	\
	(AW_PID_1852_VOUT_VFBSET_9P5V << AW_PID_1852_VOUT_VFBSET_START_BIT)

#define AW_PID_1852_VOUT_VFBSET_10P5V	(2)
#define AW_PID_1852_VOUT_VFBSET_10P5V_VALUE	\
	(AW_PID_1852_VOUT_VFBSET_10P5V << AW_PID_1852_VOUT_VFBSET_START_BIT)

/*
#define AW_PID_1852_VOUT_VFBSET_10P5V	(3)
#define AW_PID_1852_VOUT_VFBSET_10P5V_VALUE	\
	(AW_PID_1852_VOUT_VFBSET_10P5V << AW_PID_1852_VOUT_VFBSET_START_BIT)
*/

#define AW_PID_1852_VOUT_VFBSET_DEFAULT_VALUE	(1)
#define AW_PID_1852_VOUT_VFBSET_DEFAULT	\
	(AW_PID_1852_VOUT_VFBSET_DEFAULT_VALUE << AW_PID_1852_VOUT_VFBSET_START_BIT)

/* VOUT_VREFSET bit 5:0 (BSTCTRL2 0x61) */
#define AW_PID_1852_VOUT_VREFSET_START_BIT	(0)
#define AW_PID_1852_VOUT_VREFSET_BITS_LEN	(6)
#define AW_PID_1852_VOUT_VREFSET_MASK	\
	(~(((1<<AW_PID_1852_VOUT_VREFSET_BITS_LEN)-1) << AW_PID_1852_VOUT_VREFSET_START_BIT))

#define AW_PID_1852_VOUT_VREFSET_3P125V	(0)
#define AW_PID_1852_VOUT_VREFSET_3P125V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P125V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_3P25V	(1)
#define AW_PID_1852_VOUT_VREFSET_3P25V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P25V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_3P375V	(2)
#define AW_PID_1852_VOUT_VREFSET_3P375V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P375V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_3P5V	(3)
#define AW_PID_1852_VOUT_VREFSET_3P5V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P5V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_3P625V	(4)
#define AW_PID_1852_VOUT_VREFSET_3P625V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P625V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_3P75V	(5)
#define AW_PID_1852_VOUT_VREFSET_3P75V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_3P75V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_11V	(63)
#define AW_PID_1852_VOUT_VREFSET_11V_VALUE	\
	(AW_PID_1852_VOUT_VREFSET_11V << AW_PID_1852_VOUT_VREFSET_START_BIT)

#define AW_PID_1852_VOUT_VREFSET_DEFAULT_VALUE	(0x33)
#define AW_PID_1852_VOUT_VREFSET_DEFAULT	\
	(AW_PID_1852_VOUT_VREFSET_DEFAULT_VALUE << AW_PID_1852_VOUT_VREFSET_START_BIT)

/* default value of BSTCTRL2 (0x61) */
/* #define AW_PID_1852_BSTCTRL2_DEFAULT		(0x6673) */

/* detail information of registers end */
/********************************************
 * Volume Coefficient
 *******************************************/
#define AW_PID_1852_VOL_STEP		(6 * 2)

/********************************************
 * Vcalb
 *******************************************/
#define AW_PID_1852_EF_VSN_GESLP_MASK		(~0x03ff)
#define AW_PID_1852_EF_VSN_GESLP_SIGN_MASK		(~0x0200)
#define AW_PID_1852_EF_VSN_GESLP_NEG		(~0xfc00)

#define AW_PID_1852_EF_ISN_GESLP_MASK		(~0x03ff)
#define AW_PID_1852_EF_ISN_GESLP_SIGN_MASK		(~0x0200)
#define AW_PID_1852_EF_ISN_GESLP_NEG		(~0xfc00)

#define AW_PID_1852_CABL_BASE_VALUE			(1000)
#define AW_PID_1852_ICABLK_FACTOR			(1)
#define AW_PID_1852_VCABLK_FACTOR			(1)

#define AW_PID_1852_VCAL_FACTOR			(1<<13)

#define AW_PID_1852_MONITOR_VBAT_RANGE		(6025)
#define AW_PID_1852_MONITOR_INT_10BIT		(1023)
#define AW_PID_1852_MONITOR_TEMP_SIGN_MASK		(~(1<<9))
#define AW_PID_1852_MONITOR_TEMP_NEG_MASK		(0XFC00)
/********************************************
 * Dither
 *******************************************/
#define AW_PID_1852_DITHER_START_BIT	(7)
#define AW_PID_1852_DITHER_BITS_LEN	(1)
#define AW_PID_1852_DITHER_MASK	\
	(~(((1<<AW_PID_1852_DITHER_BITS_LEN)-1) << AW_PID_1852_DITHER_START_BIT))

#define AW_PID_1852_DITHER_DISABLE	(0)
#define AW_PID_1852_DITHER_DISABLE_VALUE	\
	(AW_PID_1852_DITHER_DISABLE << AW_PID_1852_DITHER_START_BIT)

#define AW_PID_1852_DITHER_ENABLE	(1)
#define AW_PID_1852_DITHER_ENABLE_VALUE	\
	(AW_PID_1852_DITHER_ENABLE << AW_PID_1852_DITHER_START_BIT)

#endif  /* #ifndef  __AW_PID_1852_REG_H__ */
